<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads, packages and installs the current release version of Evernote</string>
  <key>Identifier</key>
  <string>com.github.darklordbrock.install.Evernote</string>
  <key>Input</key>
  <dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.4.0</string>
  <key>ParentRecipe</key>
  <string>com.github.autopkg.pkg.Evernote</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>Installer</string>
    </dict>
  </array>
</dict>
</plist>
