<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest JDK 7 and copies the package to the build directory with an appended version number.</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.recipes.pkg.OrcaleJava7JDK</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JDK</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.OracleJava7JDK</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>
