<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest release version of Oracle Java 7 JDK and imports into a Munki repository.</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.pkg.OracleJava7JDK</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OracleJava7JDK</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.jaharmi.download.OracleJava7JDK</string>
    <key>Process</key>
    <array>
        <dict>
			
        </dict>
    </array>
</dict>
</plist>