<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest R Software</string>
    <key>Identifier</key>
    <string>com.github.darklordbrock.recipes.pkg.R</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>R</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.R</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%RECIPE_CACHE_DIR%/downloads/R.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgCopier</string>
        </dict>
    </array>
</dict>
</plist>
